# Exercício 1 - Titanic

Neste exercício vamos trabalhar com um outro clássico dataset de aprendizagem de máquina: sobreviventes do titanic. Este também é um problema de classificação que visa dado um conjunto de informações dos passageiros do Titanic, pretende-se classifica-los em "sobreviveu" ou "não sobreviveu" ao naufrágio.

A tarefa é fazer uma análise dos atributos e consequentemente pesquisar em como deixa-lo no formato adequado para uso dos modelos de Aprendizagem de Máquina. Em seguida, deve ser usado um modelo KNN para fazer treinar um modelo e aplica-lo a 

O arquivo final deve ser submetido no Kaggle:

https://www.kaggle.com/c/titanic/data (é necessário fazer um cadastro no Kaggle)

# Etapa 1: Pré-Processamento dos Dados

A primeira etapa é fazer o processamento da base de dados para que ela fique no formato apropriado para os algoritmos de machine learning. Deve ser analisado os atributos que compõe a base e como podemos modifica-lo. No modelo de KNN devemos usar somente atributos numéricos, logo devemos tranformar tais atributos. O grupo deve pesquisar e analisar que outras alterações podemos fazer na base de dados.

In [1]:
import pandas as pd
import numpy as np

from sklearn.model_selection import cross_val_score

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/adolfoguimaraes/machinelearningclass/master/datasets/titanic/train.csv")

print("Tabela Original")
df.head()

Tabela Original

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# Etapa 2: Treinamento do Modelo com a base transformada

Treine um modelo que permita classificar os passageiros em sobreviventes ou não. Aponte como resposta o código e a acurácia do modelo usando o KNN.

# Etapa 3 - Teste

O Kaggle disponibiliza uma base de teste sem rótulos para que possamos testar o modelo criado. 

Para que possamos utilizar a base de dados de teste no modelo treinado, devemo aplicar as mesmas transformações na base de testes.

In [3]:
df_test = pd.read_csv("https://raw.githubusercontent.com/adolfoguimaraes/machinelearningclass/master/datasets/titanic/test.csv")

df_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [ ]:
# Insira seu código a partir deste espaço

Aplique o modelo treinado à base de teste.

In [ ]:
# Insira seu código a partir deste espaço 
# O resultado do predict deve ser salvo na variável predict_values para ser gerado o arquivo correspondente.

# Etapa 4: Submissão no Kaggle

Por fim, gere o arquivo no formato exigido pelo Kaggle e submeta na competição correspondente. Informe a acurácia retornada pelo Kaggle e compare com a sua.

In [ ]:
def generate_csv(id_values, predict_result, filename):
    count = 0
    values = []
    for id_value in id_values:
        values.append((int(id_value), int(predict_result[count])))
        count += 1

    df = pd.DataFrame(values, columns=['PassengerId','Survived']) 
    df.to_csv(filename + ".csv", sep=',', columns=['PassengerId','Survived'], index=False)

In [ ]:
generate_csv(test_ids, predict_values, "output")

In [ ]:
# Use para baixar o arquivo do colab
from google.colab import files
files.download('output.csv')